# ImportModelOutOfRange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ImportModelOutOfRange Property
BuiltInFailures..::..ImportFailures Class See Also
---
The imported model is out of range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ImportModelOutOfRange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportModelOutOfRange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ImportModelOutOfRange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace